[{"bodyID":"","bodyName":"","officeClass":"governor","office":"Governor","distMap":"","distAreas":"","party":"Democratic-Farmer-Labor","first":"Tim","last":"Walz","incumbent":"n","photocrop":"/assets/images/Walz.jpg","bio":"I’m a teacher, a veteran and a football coach from Mankato. As congressman from southern Minnesota, I have a proven record of working across the aisle. I am committed to a One Minnesota agenda that gives everyone, no matter what they look like or where they are from, a great education and affordable health care.","issue1-label":"State spending","issue1":"Says when Minnesota is in a strong fiscal position, that must be reflected in its communities. Calls for honest conversations about what are the priorities for education, health care and infrastructure in the state, and then smart investments to get there.","issue2-label":"Schools","issue2":"Past work as high school teacher, coach and dad to public school students has shown him the importance of a good education. Would fully fund classrooms in all of the state. Supports access to pre-K, recruitment of quality teachers, expanded technical education.","issue3-label":"Guns","issue3":"Notes background as sportsman and veteran, but says events of past few years has changed his view of gun laws. Supports assault weapons ban, closing gun show loophole, funding research into gun violence and instituting criminal background checks.","issue4-label":"Refugees","issue4":"Believes that refugees strengthen the state’s communities. Notes they have often left dangerous situations, and as legal workers are important to the state’s economy and society. Says thorough vetting needed but state must keep tradition of welcoming refugees.","issue5-label":"Health care","issue5":"Calls for action to ensure every Minnesotan has access to high-quality, affordable health coverage. Would fight to lower the price of health care, increase price transparency, lower prescription costs and provide a public health care option through a MinnesotaCare buy-in.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"governor","office":"Governor","distMap":"","distAreas":"","party":"Republican","first":"Jeff","last":"Johnson","incumbent":"n","photocrop":"/assets/images/Johnson.jpg","bio":"Born and raised in Detroit Lakes, graduated from Concordia College in Moorhead and Georgetown Law School. In 2001, started Midwest Employment Resources. In final term as Hennepin County commissioner. Served six years in the state House of Representatives and is the 2018 elected Republican candidate for governor.","issue1-label":"State spending","issue1":"Believes that government spends too much. Cites 54 percent increase in state spending in eight years, and says Minnesotans are taxed more than almost anyone in the United States. Audit state programs for effectiveness; fund those that work and end those that don’t.","issue2-label":"Schools","issue2":"Says top-down education policy has failed and wants to free parents, teachers and students. That means rolling back mandates on schools, simplifying funding, giving parents more choice in where their children go to school and more freedom for teachers.","issue3-label":"Guns","issue3":"Opposed to any new restrictions on guns, says it won’t solve the problems causing violence in society. Says discussion is needed about family breakdowns, mental illness, celebration of violence in pop culture and policies that ignore violent student behavior.","issue4-label":"Refugees","issue4":"Says Minnesota has been much more generous than any other state regarding refugees, but that despite past success stories, resettlement program not working right now. Says state must end participation until it’s assessed for real costs and benefits to communities.","issue5-label":"Health care","issue5":"Wants to continue to protect those with pre-existing conditions while forcing more competition into the health care system. Says that would lead to more control over health care and choice in insurance. Calls DFL approach on health care the wrong direction.","website":"","ststory":""},{"bodyID":"senate","bodyName":"U.S. Senate","officeClass":"senspec","office":"Special election","distMap":"","distAreas":"","party":"Democrat","first":"Tina","last":"Smith","incumbent":"y","photocrop":"/assets/images/Smith.jpg","bio":"I came to Minnesota 34 years ago with my husband, Archie, to work at General Mills. We have two sons and two daughters-in-law. I got involved in politics by volunteering on local campaigns while I was a small-business owner. In the U.S. Senate I work to ensure Minnesotans have freedom and opportunity to live the lives they want.","issue1-label":"Taxes","issue1":"Sees job as doing what’s best for all, and says she’s working to find common ground and bipartisan solutions. That’s why she supports tax reform that makes families the priority rather than what she called huge giveaways to the richest Americans, large corporations.","issue2-label":"National debt","issue2":"Calls for parties to work together to address rising national debt in a responsible way, but not by cutting programs that hardworking Minnesotans depend on. That includes both Social Security and health care benefits vital to the well-being of many.","issue3-label":"Immigration","issue3":"Says a fair immigration process needed to ensure the well-being of all families and prevent the wrong people from coming here. Voted for $25 billion increase in border security, supports tough but fair path to citizenship, solution for children brought to the U.S.","issue4-label":"Health care","issue4":"Opposed to repealing the ACA, says its many consumer protections still needed, especially for pre-existing conditions. Need to address the rising cost of health care including prescription medicine. Says big drug companies must be held accountable on those costs.","issue5-label":"Guns","issue5":"Wants to pass what she calls common-sense gun reforms to help end gun violence. Has supported expanded background checks for all gun sales, and bans on bump stocks, assault weapons and high-capacity magazines. Ban convicted stalkers from buying firearms.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"senspec","office":"Special election","distMap":"","distAreas":"","party":"Republican","first":"Karin","last":"Housley","incumbent":"n","photocrop":"/assets/images/Housley.jpg","bio":"Born and raised in South St. Paul. Communications degree from State University of New York, owns and operates a real estate business. Married high school sweetheart Phil Housley, and lives in St. Marys Point. Four grown children, two grandsons. Elected to Minnesota Senate in 2012, chairs Aging and Long-Term Care Committee. ","issue1-label":"Taxes","issue1":"Says she understands stifling effect of high taxes as a small-business owner. Says the 2017 GOP tax law brought historic unemployment and staggering job growth with positive effects in nearly all economic sectors. Thinks cuts must be made permanent. ","issue2-label":"National debt","issue2":"Believes debt and wasteful spending threaten future generations. Wants to balance budget, cut taxes and encourage innovation. Does not support privatizing Social Security, says bipartisan fix needed to protect benefits, avoid tax increases, keep retirement age. ","issue3-label":"Immigration","issue3":"Says the U.S. was founded by immigrants and they continue to enrich nation, but fixes are needed to system if future economy is to thrive. First step is secure borders, additional enforcement at borders and ports of entry, streamlining immigration case backlog. ","issue4-label":"Health care","issue4":"Thinks ACA caused premiums to skyrocket, reduced care quality. Solution must be patient-centered, market-driven. Let parents keep kids on plans, keep pre-existing protections. Increase transparency in care costs, promote generic prescriptions, sell across state lines. ","issue5-label":"Guns","issue5":"Calls right to bear arms fundamental to Constitution. Address violence by enforcing existing laws, preventing criminals and terrorists from instant access to guns. Improve mental health treatment. Supports reasonable bump stock ban, is open to further dialogue. ","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"sensched","office":"Scheduled election","distMap":"","distAreas":"","party":"Democrat","first":"Amy","last":"Klobuchar","incumbent":"y","photocrop":"/assets/images/Klobuchar.jpg","bio":"I’ve been guided by values I learned growing up in Minnesota. Serving in the U.S. Senate, I have one aim: a strong Minnesota. That’s why I work with Democrats and Republicans to strengthen our economy and support families, workers and businesses. In 2016, I was ranked first among all 100 senators for bills enacted into law.","issue1-label":"Taxes","issue1":"Supports bringing down business and middle-class tax rates, but not in a way that adds $1 trillion to national debt. Says tax changes should help the middle class, simplify the tax code, and bring back money that’s held overseas to fund infrastructure at home.","issue2-label":"National debt","issue2":"Does not back cuts or privatization of Social Security or Medicare. Will continue to push for legislation to promote sound tax policy, close loopholes, cut subsidies to oil companies, and a long-term plan to responsibly reduce debt.","issue3-label":"Immigration","issue3":"Calls current immigration system broken and says it’s holding back the economy. Has worked to pass comprehensive reform that would include enhanced border security, an accountable pathway to earned citizenship, the DREAM Act, and reducing the debt.","issue4-label":"Health care","issue4":"Says Congress must improve, not repeal, the Affordable Care Act. Calls for federal reinsurance and cost-sharing to reduce premiums. Retain patient protections, such as keeping kids insured until age 26. Can’t go back to kicking people off insurance for pre-existing conditions.","issue5-label":"Guns","issue5":"Would do more to keep communities safe while allowing law- abiding Americans to have guns. Supports universal background checks, closing the gun show loophole, and keeping guns from terrorists, stalkers and the mentally ill.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"sensched","office":"Scheduled election","distMap":"","distAreas":"","party":"Republican","first":"Jim","last":"Newberger","incumbent":"n","photocrop":"/assets/images/Newberger.jpg","bio":"Lifelong Minnesotan, Hopkins Lindbergh High School and St. Cloud State University graduate. Paramedic for 30 years at level I trauma center in Twin Cities. Christian Missions team leader. Becker Planning Commission for two years, state representative for three terms. Vice chairman, House Jobs and Energy Committee.","issue1-label":"Taxes","issue1":"Would make all 2017 tax cuts permanent, wants to repeal estate taxes, which he says would help families keep farms. Opposed to medical device taxes. Believes in lower taxes as a general principle, says it means Minnesotans get to keep more of their money. ","issue2-label":"National debt","issue2":"Says he would protect Social Security and Medicare, calls them promises made to voters that must be kept. Wants to address what he calls out-of-control waste, fraud and abuse. Work as paramedic has shown him importance of Medicare, but not Medicare for All.","issue3-label":"Immigration","issue3":"Supports the Mexico border wall, says borders should be secured. Promote legal immigration, end sanctuary city policies. Would shut down refugee resettlement program and work to bring down costs, give local communities input, vet refugees more thoroughly. ","issue4-label":"Health care","issue4":"Would vote to repeal Affordable Care Act, replace it with a free market system. Says that would drive down costs and increase quality. Wants to stop overpricing of prescription drugs, give all Minnesotans the opportunity to be insured and restore MinnesotaCare as safety net.","issue5-label":"Guns","issue5":"Supports the Second Amendment and says he has the voting record to prove it. Says there is a mental health crisis but that it can be addressed without infringing on gun rights. Supports high school trap shooting leagues. ","website":"","ststory":""},{"bodyID":"house","bodyName":"U.S. House","officeClass":"dist1","office":"District 1","distMap":"/assets/images/dist1.png","distAreas":"Mankato, Rochester, Winona, Albert Lea, Austin, Owatonna, Worthingon, New Ulm","party":"Democrat","first":"Dan","last":"Feehan","incumbent":"n","photocrop":"/assets/images/Feehan.jpg","bio":"Southern Minnesota native. Joined Army ROTC and served two tours in Iraq after 9/11. Taught middle school math and served in the Pentagon.","issue1-label":"Tariffs","issue1":"Farmers say tariffs are hurting them by closing markets. Con­gress needs to be more involved and the trade war must be ended.","issue2-label":"Taxes","issue2":"Congress needs to provide real, direct tax relief to the middle class. Says 2017 tax bill gave most benefits to ultrawealthy.","issue3-label":"National debt","issue3":"Don’t balance budget at expense of retirement security. Cut debt by ending 17-year, $5 trillion “perpetual war” following 9 /11.","issue4-label":"Immigration","issue4":"Comprehensive reform must strengthen borders and the economy. Minimize migration under dire circumstances.","issue5-label":"Guns","issue5":"As a soldier/teacher, calls issue “personal.” Begin to end gun vio­ lence with research, bar violent criminals from getting guns.","website":"","ststory":""},{"bodyID":"","bodyName":"U.S. House","officeClass":"dist1","office":"District 1","distMap":"/assets/images/dist1.png","distAreas":"Mankato, Rochester, Winona, Albert Lea, Austin, Owatonna, Worthingon, New Ulm","party":"Republican","first":"Jim","last":"Hagedorn","incumbent":"n","photocrop":"/assets/images/Hagedorn.jpg","bio":"Born in Blue Earth. Former con­ gressional staffer and U.S. Dep­artment of Treasury employee, manager for southern Minnesota businesses.","issue1-label":"Tariffs","issue1":"Does not favor tariffs as they are negative for some. Wants to work with President Donald Trump to improve trade policies.","issue2-label":"Taxes","issue2":"Supports 2017 tax bill, citing new jobs in Minnesota, tax cuts for families and reduced corporate taxes on state businesses.","issue3-label":"National debt","issue3":"Does not support entitlement cuts — says those who have con­tributed to Medicare, Social Security must get promised benefits.","issue4-label":"Immigration","issue4":"Supports border wall, merit­ based immigration, work pro­grams, no “catch and release.” Against sanctuary cities.","issue5-label":"Guns","issue5":"Against new limits on gun sales, saying they won’t reduce vio­lence. Supports allowing service members to carry guns on bases.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"dist2","office":"District 2","distMap":"/assets/images/dist2.png","distAreas":"Scott Co., Dakota Co., Goodhue Co., Wabasha Co., Cottage Grove, Burnsville, Eagan","party":"Democrat","first":"Angie","last":"Craig","incumbent":"n","photocrop":"/assets/images/Craig.jpg","bio":"Raised by single mother in mobile home park. Put herself through college, rose to executive at St. Jude Medical. Lives in Eagan; she and her wife have four sons.","issue1-label":"Taxes","issue1":"Says GOP tax law helped corpora­tions, wealthiest. Wants middle class, working families, small business owners to see benefits.","issue2-label":"National debt","issue2":"No cuts to Social Security, Medi­care, which she says have been earned. Debt caused by tax cuts to corporations and the wealthy.","issue3-label":"Immigration","issue3":"Wants bipartisan bill with bor­der security, path to citizenship for “Dreamers” and law­abiding immigrants, families intact.","issue4-label":"Health care","issue4":"Keep pre­existing condition pro­ tections, fix the ACA and reduce costs of health care, especially the cost of prescription drugs.","issue5-label":"Guns","issue5":"Fund federal gun violence research. Wants universal back­ground checks, stop terrorists on no-­fly lists from buying guns.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"dist2","office":"District 2","distMap":"/assets/images/dist2.png","distAreas":"Scott Co., Dakota Co., Goodhue Co., Wabasha Co., Cottage Grove, Burnsville, Eagan","party":"Republican","first":"Jason","last":"Lewis","incumbent":"y","photocrop":"/assets/images/Lewis.jpg","bio":"Second year in Congress, on trans­portation, budget and education committees. Worked on criminal justice, reining in Met Council. Married with two daughters.","issue1-label":"Taxes","issue1":"Says 2017 tax reform lifted econ­omy, led to wage and job growth. Says the changes must be kept in place to preserve prosperity.","issue2-label":"National debt","issue2":"Keep promise of Social Security, Medicare for those approaching retirement. Wants discussion about long­term solvency.","issue3-label":"Immigration","issue3":"Favors complete overhaul of immigration system. Supports consensus measures that secures border, helps “Dreamers.”","issue4-label":"Health care","issue4":"Wants to replace ACA, says it coerced people into expensive plans they didn’t want. Wants more choices, competition.","issue5-label":"Guns","issue5":"Do a better job enforcing cur­rent gun laws, prosecute more who illegally purchase firearms. Improve background checks.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"dist3","office":"District 3","distMap":"/assets/images/dist3.png","distAreas":"Bloomington, Brooklyn Park, Coon Rapids, Eden Prairie, Edina, Maple Grove, Plymouth, Wayzata","party":"Democrat","first":"Dean","last":"Phillips","incumbent":"n","photocrop":"/assets/images/Phillips.jpg","bio":"Gold Star son, father of two, businessman. Growing up, taught the value of hard work. Collaborative approach, not accepting special interest money.","issue1-label":"Taxes","issue1":"Says not enough for middle class in 2017 tax bill. Make middle class cuts permanent by undoing estate tax, exemptions.","issue2-label":"National debt","issue2":"Honor promise of Social Security, Medicaid. Reduce health care costs, let wealthier retirees pass benefits to lower-income.","issue3-label":"Immigration","issue3":"Immigration has been used to divide, parties share blame. Supports DREAM Act, secure borders, pathway to citizenship.","issue4-label":"Health care","issue4":"Every American needs affordable, high-quality care. Fix and improve ACA, Medicare buy-in, prescription price negotiations.","issue5-label":"Guns","issue5":"Says action needed. Wants universal background checks, bar guns from domestic abusers, reinstate assault weapons ban.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"dist3","office":"District 3","distMap":"/assets/images/dist3.png","distAreas":"Bloomington, Brooklyn Park, Coon Rapids, Eden Prairie, Edina, Maple Grove, Plymouth, Wayzata","party":"Republican","first":"Erik","last":"Paulsen","incumbent":"y","photocrop":"/assets/images/Paulsen.jpg","bio":"A voice on issues important to the state, a stronger economy and safe communities. He and his wife have four daughters. Played key role in passing GOP tax bill.","issue1-label":"Taxes","issue1":"Believes tax bill unleashed economy; bigger paychecks and bonuses, low unemployment, new jobs, growth. No repeal.","issue2-label":"National debt","issue2":"Stronger economy increasing tax revenue, Washington must address spending. Strengthen, secure Social Security, Medicare.","issue3-label":"Immigration","issue3":"Need to modernize broken system. Split with party to boost border security, end family separations, protect DREAMers.","issue4-label":"Health care","issue4":"ACA improved access for some but harmed more with higher premiums, deductibles. Bipartisan solution must address costs.","issue5-label":"Guns","issue5":"Backs restrictions on firearm access for dangerous individuals, gun violence research, improved background checks.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"dist4","office":"District 4","distMap":"/assets/images/dist4.png","distAreas":"Ramsey Co., St. Paul, Roseville, Maplewood, Woodbury, Lake Elmo, Mahtomedi, Shoreview","party":"Democrat","first":"Betty","last":"McCollum","incumbent":"y","photocrop":"/assets/images/McCollum.jpg","bio":"North St. Paul City Council, Minnesota House, second woman elected to Congress from state. Top Democrat on Interior-Environment spending committee.","issue1-label":"Taxes","issue1":"2017 tax cuts benefit wealthy, deduction caps will cost Minnesotans. Replace with cuts to benefit middle class, small business.","issue2-label":"National debt","issue2":"Says Congress must work to strengthen Social Security, Medicare, Medicaid and food assistance.","issue3-label":"Immigration","issue3":"Need comprehensive reform, protect DREAM Act, no family separation. Resettle 75K refugees yearly, no border wall.","issue4-label":"Health care","issue4":"ACA is benefiting tens of millions of American and should be strengthened. Republican plans would cost 30 million coverage.","issue5-label":"Guns","issue5":"Ban assault weapons, high volume magazines, bump stocks. Waiting period for all gun sales, universal background checks.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"dist4","office":"District 4","distMap":"/assets/images/dist4.png","distAreas":"Ramsey Co., St. Paul, Roseville, Maplewood, Woodbury, Lake Elmo, Mahtomedi, Shoreview","party":"Republican","first":"Greg","last":"Ryan","incumbent":"n","photocrop":"/assets/images/Ryan.jpg","bio":"Co-owns and has run a 67-year-old family heating and plumbing business in St. Paul for 34 years. Grandfather, great-grandfather were Minnesota legislators.","issue1-label":"Taxes","issue1":"Republicans didn’t go far enough in 2017. Wants Congress to cut federal spending and use the savings to cut taxes further.","issue2-label":"National debt","issue2":"No entitlement cuts yet, but says budgets should be cut at the agencies that deliver benefits like Medicare, Social Security.","issue3-label":"Immigration","issue3":"Reduce the rate of legal immigration, make decisions based on merit. Work on filling jobs with more American workers.","issue4-label":"Health care","issue4":"Thinks the ACA was flawed from the get-go, caused problems at his business. Increase choices, sell plans across state lines.","issue5-label":"Guns","issue5":"Says laws currently on the books are enough. States have the right to pass more restrictive laws but it’s not a federal role.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"dist5","office":"District 5","distMap":"/assets/images/dist5.png","distAreas":"Minneapolis, St. Louis Park, Edina, Richfield, Crystal, Robbinsdale, Golden Valley, Fridley","party":"Democrat","first":"Ilhan","last":"Omar","incumbent":"n","photocrop":"/assets/images/Omar.jpg","bio":"I’m a working mom, a legisla­tor, a refugee, a college graduate with student debt, an intersec­tional feminist and an organizer. Came to U.S. from Somalia at 12.","issue1-label":"Taxes","issue1":"Congress should repeal 2017 tax cuts, especially cuts to income, corporate and estate taxes. Says wealthiest saw most benefits.","issue2-label":"National debt","issue2":"Would not support any cuts to Social Security, Medicare. Favors new investments in education, health care and infrastructure.","issue3-label":"Immigration","issue3":"Abolish ICE, end deportation and detention, no border wall. Protect sanctuary policies, fight criminalization of immigration.","issue4-label":"Health care","issue4":"Affordable, quality health care is a right. Move toward single­ payer Medicare for All, including dental, vision, long­term care.","issue5-label":"Guns","issue5":"Wants ban on assault weapons, high­-capacity magazines. Uni­versal background checks, funding for mental health treatment.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"dist5","office":"District 5","distMap":"/assets/images/dist5.png","distAreas":"Minneapolis, St. Louis Park, Edina, Richfield, Crystal, Robbinsdale, Golden Valley, Fridley","party":"Republican","first":"Jennifer","last":"Zielinski","incumbent":"n","photocrop":"/assets/images/Zielinski.jpg","bio":"I’ve lived in the Twin Cities my whole life. University of Minne­sota graduate, works in health care. Community volunteer and Republican activist.","issue1-label":"Taxes","issue1":"Believes that Congress should not repeal any of the tax cuts that Republicans approved in 2017.","issue2-label":"National debt","issue2":"Says she would not support any cuts to entitlement programs such as Social Security or Medi­care in order to balance budget.","issue3-label":"Immigration","issue3":"Start by enforcing current immigration laws, but would work to give anyone here undoc­umented a path to citizenship.","issue4-label":"Health care","issue4":"Not willing to vote to repeal the Affordable Care Act if there’s not a better solution in place to replace it.","issue5-label":"Guns","issue5":"Does not support further lim its on guns; says the better approach is to enforce laws that are already on the books.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"dist6","office":"District 6","distMap":"/assets/images/dist6.png","distAreas":"Benton Co., Carver Co., Sherburne Co., Wright Co., Anoka Co., Forest Lake, Hugo, Cold Spring","party":"Democrat","first":"Ian","last":"Todd","incumbent":"n","photocrop":"/assets/images/Todd.jpg","bio":"Air Force veteran, geospatial intelligence analyst for six years. First­time candidate, running to combat greed, dishonesty and division in government.","issue1-label":"Taxes","issue1":"Replace 2017 tax cuts with higher taxes on producers of income inequality, and more favorable treatment of small businesses.","issue2-label":"National debt","issue2":"Protect entitlements. Repeal tax cuts instead, reduce incarcera­tion, bring troops home, remove payroll cap on Social Security.","issue3-label":"Immigration","issue3":"Need real path to citizenship for everyone who calls the U.S. home. Keep vetting in place but remove wasteful aspects.","issue4-label":"Health care","issue4":"Work toward a better system of truly universal health care. Sup ports Medicare for All, don’t let companies easily deny coverage.","issue5-label":"Guns","issue5":"Calls for more robust universal background checks using elec­tronic cataloging. Allow federal research into gun violence.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"dist6","office":"District 6","distMap":"/assets/images/dist6.png","distAreas":"Benton Co., Carver Co., Sherburne Co., Wright Co., Anoka Co., Forest Lake, Hugo, Cold Spring","party":"Republican","first":"Tom","last":"Emmer","incumbent":"y","photocrop":"/assets/images/Emmer.jpg","bio":"Grew up in Minnesota, law degree from William Mitchell. Second term in House, member of Financial Services and GOP leadership. Married, seven kids.","issue1-label":"Taxes","issue1":"Tax cuts critical to economic comeback. Wages, consumer confidence up; unemployment low. Cuts should be permanent.","issue2-label":"National debt","issue2":"Medicare, Social Security are critical and must be sustained. Protect these programs for seniors, the vulnerable.","issue3-label":"Immigration","issue3":"Base immigration on merit, not chance. Make legal immigration easier, restrict incentives to ille­gal immigration.","issue4-label":"Health care","issue4":"Health care is too expensive and the ACA didn’t help. Too hard to get treatment for behavioral health conditions.","issue5-label":"Guns","issue5":"Current law requires licensed dealers to initiate background checks. Database should include more complete records.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"dist7","office":"District 7","distMap":"/assets/images/dist7.png","distAreas":"Moorhead, Fergus Falls, Alexandria, Willmar, Bemidji, Marshall, Hutchinson","party":"Democrat","first":"Collin","last":"Peterson","incumbent":"y","photocrop":"/assets/images/Peterson.jpg","bio":"MSU-Moorhead graduate, North Dakota National Guard. CPA and business owner before 1990 election to Congress. Ranking Democrat on House Agriculture.","issue1-label":"Tariffs","issue1":"Blames the Trump administration for pushing farmers into trade war. Says farmers shouldn’t bear burden of other industries.","issue2-label":"Taxes","issue2":"Says 2017 tax bill didn’t help middle class, added to national debt and complicated taxes for many small businesses.","issue3-label":"National debt","issue3":"Supports balanced budget amendment. Says Congress can reduce spending without raiding Social Security, Medicare.","issue4-label":"Immigration","issue4":"Wants immigration reform to address workforce shortage and border security. Sponsored legal help for farmers, small business.","issue5-label":"Guns","issue5":"Any changes must truly reduce gun violence. Better background checks, pass red flag laws to keep guns from mentally ill.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"dist7","office":"District 7","distMap":"/assets/images/dist7.png","distAreas":"Moorhead, Fergus Falls, Alexandria, Willmar, Bemidji, Marshall, Hutchinson","party":"Republican","first":"Dave","last":"Hughes","incumbent":"n","photocrop":"/assets/images/Hughes.jpg","bio":"A 21-year veteran of U.S. Air Force, served in Iraq, retired as a major. Works as instructor pilot for U.S. Customs and Border Protection. Married with seven kids.","issue1-label":"Tariffs","issue1":"Sees tariffs as a strong negotiating tool to secure fair, free markets for farmers and manufacturers. But must be short-term only.","issue2-label":"Taxes","issue2":"Calls tax overhaul a meaningful win for western Minnesotans. Leave cuts in place, make them permanent and expand on them.","issue3-label":"National debt","issue3":"Secure Social Security, Medicare for current and future generations, but the only way to do that is balance the budget, reduce debt.","issue4-label":"Immigration","issue4":"Supports Trump administration: secure borders, no sanctuary policies. A simpler system would help fix workforce issues.","issue5-label":"Guns","issue5":"Opposed to any additional limits on gun sales from Congress. Says he is a strong supporter of Second Amendment.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"dist8","office":"District 8","distMap":"/assets/images/dist8.png","distAreas":"Duluth, Grand Rapids, Hibbing, Virginia, Brainerd, Little Falls","party":"Democrat","first":"Joe","last":"Radinovich","incumbent":"n","photocrop":"/assets/images/Radinovich.jpg","bio":"I learned the value of hard work, compassion and overcoming adversity growing up in Crosby. Union organizer, state representative, IRRRB appointee.","issue1-label":"Tariffs","issue1":"Workers hurt by unfair trade but administration’s approach is overly broad. Mining jobs were already on the way back.","issue2-label":"Taxes","issue2":"Repeal billions in tax cuts to wealthy and corporations. Use money for broadband, infrastructure, health care, education.","issue3-label":"National debt","issue3":"Protecting, strengthening Social Security and Medicare is top priority. Given tax cuts to wealthy, don't ask more from seniors.","issue4-label":"Immigration","issue4":"Wants to work for bipartisan improvements. Bring people from shadows, improve visa process, efficient border security. ","issue5-label":"Guns","issue5":"Wants universal background\nchecks, ban on bump stock and high-capacity magazines, age of 21 to buy assault-style firearms.","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"dist8","office":"District 8","distMap":"/assets/images/dist8.png","distAreas":"Duluth, Grand Rapids, Hibbing, Virginia, Brainerd, Little Falls","party":"Republican","first":"Pete","last":"Stauber","incumbent":"n","photocrop":"/assets/images/Stauber.jpg","bio":"From playing hockey to two-plus decades in law enforcement, I am a problem solver. My wife and our four children are a major reason I’m running.","issue1-label":"Tariffs","issue1":"Workers on the Iron Range can compete on an even playing field. Committed to reversing years of unfair trade policies.","issue2-label":"Taxes","issue2":"Minnesota taxpayers are seeing relief from 2017 tax cuts, which also leveled the playing field for small business.","issue3-label":"National debt","issue3":"Medicare, Social Security benefits were earned and promised. Medicare for All proposal is too costly, would hurt seniors.","issue4-label":"Immigration","issue4":"Immigrants built, continue to enrich nation. To continue this, must fix system. First secure borders, support legal immigrants.","issue5-label":"Guns","issue5":"Committed to protecting the Second Amendment, which guarantees right of law-abiding citizens to keep or bear arms.","website":"","ststory":""},{"bodyID":"statewide","bodyName":"State Offices","officeClass":"ag","office":"Attorney General","distMap":"","distAreas":"","party":"Democratic-Farmer-Labor","first":"Keith","last":"Ellison","incumbent":"n","photocrop":"/assets/images/Ellison.jpg","bio":"Keith Ellison has served in Congress for 12 years, championing consumer, worker and civil rights protections. He worked 16 years as a trial attorney and oversaw the Legal Rights Center for low-income clients. Says he wants to be attorney general because working families need a fighter, and would work to make health care more affordable, ensure a fair economy, defend equal rights, and uphold the Constitution.","issue1-label":"","issue1":"","issue2-label":"","issue2":"","issue3-label":"","issue3":"","issue4-label":"","issue4":"","issue5-label":"","issue5":"","website":"","ststory":""},{"bodyID":"","bodyName":"State Offices","officeClass":"ag","office":"Attorney General","distMap":"","distAreas":"","party":"Republican","first":"Doug","last":"Wardlow","incumbent":"n","photocrop":"/assets/images/Wardlow.jpg","bio":"Doug Wardlow earned a law degree from Georgetown University and clerked for the Minnesota Supreme Court. He worked against China’s practice of dumping steel. He wants to make Minnesota fair and safe, rebuild the AG’s criminal division, combat opioids and human trafficking, and protect against financial scams and fraud. Says he would fight illegal regulations that hurt job creators, farmers and laborers.","issue1-label":"","issue1":"","issue2-label":"","issue2":"","issue3-label":"","issue3":"","issue4-label":"","issue4":"","issue5-label":"","issue5":"","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"aud","office":"Auditor","distMap":"","distAreas":"","party":"Democratic-Farmer-Labor","first":"Julie","last":"Blaha","incumbent":"n","photocrop":"/assets/images/Blaha.jpg","bio":"Julie Blaha is a former math teacher and statewide union treasurer who worked to get members clear, accurate financial information. As auditor she would focus on transparency, support local leaders with data and financial analysis, and partner with local communities. She says she would defend the need for real, unbiased data, and would fight against further efforts to privatize functions of the State Auditor’s office.","issue1-label":"","issue1":"","issue2-label":"","issue2":"","issue3-label":"","issue3":"","issue4-label":"","issue4":"","issue5-label":"","issue5":"","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"aud","office":"Auditor","distMap":"","distAreas":"","party":"Republican","first":"Pam","last":"Myhra","incumbent":"n","photocrop":"/assets/images/Myhra.jpg","bio":"Pam Myhra is a CPA with an active license, a former audit manager with an international public accounting firm and a former two-term state representative. As auditor, would try to set the tone for effective financial audits and performance reviews of the use of government resources. Promises accountability, transparency and oversight of tax dollars. Backs the 2015 law that allowed counties to contract private firms for required audits.","issue1-label":"","issue1":"","issue2-label":"","issue2":"","issue3-label":"","issue3":"","issue4-label":"","issue4":"","issue5-label":"","issue5":"","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"sos","office":"Secretary of State","distMap":"","distAreas":"","party":"Democratic-Farmer-Labor","first":"Steve","last":"Simon","incumbent":"y","photocrop":"/assets/images/Simon.jpg","bio":"Steve Simon took office as Secretary of State in 2015. He worked to protect the state election systems from foreign attacks, and helped the state return to the top in voter turnout. If re-elected, he would continue to champion voter rights and election reform, and secure the system from outside threats. Noting only 11 known fraudulent ballots out of three million cast in 2016, he calls Minnesota’s election system among the cleanest in the U.S.","issue1-label":"","issue1":"","issue2-label":"","issue2":"","issue3-label":"","issue3":"","issue4-label":"","issue4":"","issue5-label":"","issue5":"","website":"","ststory":""},{"bodyID":"","bodyName":"","officeClass":"sos","office":"Secretary of State","distMap":"","distAreas":"","party":"Republican","first":"John","last":"Howe","incumbent":"n","photocrop":"/assets/images/Howe.jpg","bio":"John Howe is a former corrections officer, loss prevention manager, firefighter and store owner, and a former mayor of and state senator from Red Wing. Would work to make Minnesota elections most secure in the nation, and to use office’s business licensing to enhance growth. Says extent of ineligible voting in Minnesota is unknown and that greater analysis is needed of the state’s level of election integrity.","issue1-label":"","issue1":"","issue2-label":"","issue2":"","issue3-label":"","issue3":"","issue4-label":"","issue4":"","issue5-label":"","issue5":"","website":"","ststory":""}]